#pragma once

/// std
#include <memory>

/// engine
#include "2d/Sprite.h"

/// ////////////////////////////////////////////////////////////////////
/// @brief  ゲームオーバースプライト
/// ////////////////////////////////////////////////////////////////////
class GameOverSprite {
public:
	/// ==============================================================
	/// public : methods
	/// ==============================================================

	GameOverSprite();
	~GameOverSprite();

	void Init();
	void Update();
	void Draw();


private:
	/// ==============================================================
	/// private : methods
	/// ==============================================================

	std::unique_ptr<Sprite> sprite_; ///< スプライト

};

